app/controllers/cat_rental_requests_controller.rb

SELECT "cats".* FROM "cats"
---
    def new
        @cats = Cat.all

SELECT "cats".* FROM "cats"
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 4], ["start_date", "2020-06-02"], ["end_date", "2020-06-12"], ["created_at", "2020-06-26 18:36:27.932034"], ["updated_at", "2020-06-26 18:36:27.932034"], ["user_id", 9]]
---
    def create
        @cats = Cat.all
        @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)
        @cat_rental_request.requester = current_user

        if @cat_rental_request.save

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def current_cat_rental_request
        CatRentalRequest.includes(:cat).find_by(id: params[:id])