app/models/cat_rental_request.rb

    def overlapping_pending_requests
        self.overlapping_requests.where(status: 'PENDING')
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2020-06-19' OR end_date < '2020-06-03') AND "cat_rental_requests"."status" = $3  [["id", 7], ["cat_id", 2], ["status", "PENDING"]]

    def approve!
        transaction do
            self.status = 'APPROVED'
            self.save!

            overlapping_pending_requests.each do |request|
                request.update!(status: 'DENIED')
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-06-25 21:38:49.078889"], ["id", 25]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-06-25 21:23:49.877938"], ["id", 16]]